Project/Toir/src/InformationRegisters/СведенияОНоменклатуреКлассов/СведенияОНоменклатуреКлассов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОНоменклатуреКлассов</name>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/СведенияОНоменклатуреКлассов/ManagerModule.bsl
Функция ПолучитьСведенияОНоменклатуре(Ссылка) Экспорт
	
	СведенияОНоменклатуре = Новый Структура("Автор, ДатаСоздания, АвторИзменения, ДатаИзменения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОНоменклатуреКлассов.Автор,
		|	СведенияОНоменклатуреКлассов.ДатаСоздания,
		|	СведенияОНоменклатуреКлассов.АвторИзменения,
		|	СведенияОНоменклатуреКлассов.ДатаИзменения
		|ИЗ
		|	РегистрСведений.СведенияОНоменклатуреКлассов КАК СведенияОНоменклатуреКлассов
		|ГДЕ
		|	СведенияОНоменклатуреКлассов.Объект = &Объект";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СведенияОНоменклатуре, Результат);
	КонецЕсли;
	
	Возврат СведенияОНоменклатуре;
	
КонецФункции

Функция ЗаписатьСведенияОНоменклатуре(Ссылка, Автор, Дата, ЭтоНовый) Экспорт
	
	Запись = РегистрыСведений.СведенияОНоменклатуреКлассов.СоздатьМенеджерЗаписи();
	Запись.Объект = Ссылка;
	Если ЭтоНовый Тогда
		Запись.Автор        = Автор;
		Запись.ДатаСоздания = Дата;
	Иначе
		СведенияОНоменклатуре = ПолучитьСведенияОНоменклатуре(Ссылка);
		ЗаполнитьЗначенияСвойств(Запись, СведенияОНоменклатуре);
		Запись.АвторИзменения = Автор;
		Запись.ДатаИзменения  = Дата;
	КонецЕсли;
	Запись.Записать();
	
КонецФункции
